---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ToposolidContourDisplaySettingsIdParam
source: html/a24d6fdd-6e48-da18-21a4-e45e2e40da03.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ToposolidContourDisplaySettingsIdParam Property

"Contour Display"

## Syntax (C#)
```csharp
public static ForgeTypeId ToposolidContourDisplaySettingsIdParam { get; }
```